Wangzhongya123/NXPBLE_DEMO/bm/pin_mux.c
/*! *********************************************************************************
* Copyright 2013-2015, Freescale Semiconductor, Inc.
* Copyright 2016-2018 NXP
* All rights reserved.
*
* \file
*
* SPDX-License-Identifier: BSD-3-Clause
********************************************************************************** */

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v3.0
processor: QN908XC
package_id: QN9080C
mcu_data: ksdk2_0
processor_version: 2.0.0
board: QN908XCDK
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_iocon.h"
#include "pin_mux.h"

/*FUNCTION**********************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 *END**************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
}

#define PIO_FUNC_ALT4                 0x04u   /*!< Function control register: Alternative connection 4. */

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', prefix: BOARD_, coreID: cm4}
- pin_list:
  - {pin_num: '28', peripheral: FLEXCOMM0, signal: RXD, pin_signal: GPIOA17/CS3/SD_DAC/CTIMER2_MAT1/FC0_RXD/FC3_MISO/QDEC0_B, identifier: ''}
  - {pin_num: '29', peripheral: FLEXCOMM0, signal: TXD, pin_signal: GPIOA16/CS2/SCT0_OUT1/CTIMER2_MAT0/FC0_TXD/FC3_MOSI/QDEC0_A, identifier: ''}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/*FUNCTION**********************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 *END**************************************************************************/
void BOARD_InitPins(void) {
  SYSCON->PIO_FUNC_CFG[2] = ((SYSCON->PIO_FUNC_CFG[2] &
    (~(SYSCON_PIO_FUNC_CFG_PA16_FUNC_MASK | SYSCON_PIO_FUNC_CFG_PA17_FUNC_MASK))) /* Mask bits to zero which are setting */
      | SYSCON_PIO_FUNC_CFG_PA16_FUNC(PIO_FUNC_ALT4)         /* PORTA PIN16 (coords: 29) is configured as FC0_TXD */
      | SYSCON_PIO_FUNC_CFG_PA17_FUNC(PIO_FUNC_ALT4)         /* PORTA PIN17 (coords: 28) is configured as FC0_RXD */
    );
}


#define PIN19_IDX                       19u   /*!< Pin number for pin 19 in a port */
#define PIN24_IDX                       24u   /*!< Pin number for pin 24 in a port */
#define PORTA_IDX                        0u   /*!< Port index */

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitButtons:
- options: {prefix: BOARD_, coreID: cm4}
- pin_list:
  - {pin_num: '21', peripheral: GPIOA, signal: 'GPIOA, 24', pin_signal: GPIOA24/ACMP0N/CS6/ETM_TRACEDAT0/CTIMER3_CAP0/RFE_RX_EN/FC3_SSEL1/SPIFI_IO0, identifier: SW1,
    direction: INPUT, pull_control: Pull_up, drive_strength: low}
  - {pin_num: '26', peripheral: GPIOA, signal: 'GPIOA, 19', pin_signal: GPIOA19/CS5/SCT0_OUT2/RFE_EN/FC0_SCK/FC3_SSEL3/BLE_IN_PROC, direction: INPUT, pull_control: Pull_up,
    drive_strength: low, drive_extra: disabled}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/*FUNCTION**********************************************************************
 *
 * Function Name : BOARD_InitButtons
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 *END**************************************************************************/
void BOARD_InitButtons(void) {
  const uint32_t portA_pin19_config = (
    IOCON_FUNC0 |                                            /* Selects pin function 0 */
    IOCON_MODE_PULLUP |                                      /* Selects pull-up function */
    IOCON_DRIVE_LOW                                          /* Enable low drive strength */
  );
  IOCON_PinMuxSet(IOCON, PORTA_IDX, PIN19_IDX, portA_pin19_config); /* PORTA PIN19 (coords: 26) is configured as GPIOA19 */
  const uint32_t portA_pin24_config = (
    IOCON_FUNC0 |                                            /* Selects pin function 0 */
    IOCON_MODE_PULLUP |                                      /* Selects pull-up function */
    IOCON_DRIVE_LOW                                          /* Enable low drive strength */
  );
  IOCON_PinMuxSet(IOCON, PORTA_IDX, PIN24_IDX, portA_pin24_config); /* PORTA PIN24 (coords: 21) is configured as GPIOA24 */
}


#define PIN13_IDX                       13u   /*!< Pin number for pin 13 in a port */
#define PIN25_IDX                       25u   /*!< Pin number for pin 25 in a port */
#define PIN31_IDX                       31u   /*!< Pin number for pin 31 in a port */
#define PORTA_IDX                        0u   /*!< Port index */

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLEDs:
- options: {prefix: BOARD_, coreID: cm4}
- pin_list:
  - {pin_num: '12', peripheral: GPIOA, signal: 'GPIOA, 31', pin_signal: GPIOA31/DAC/RTC_CAP/CTIMER3_MAT2/SWO/FC3_SCK/SPIFI_CLK, identifier: LED_RED, direction: OUTPUT,
    pull_control: Pull_up, drive_strength: low}
  - {pin_num: '32', peripheral: GPIOA, signal: 'GPIOA, 13', pin_signal: GPIOA13/SCT0_OUT4/ACMP1_OUT/FC1_RXD_SDA/FC3_SSEL1/RFE_EN, direction: OUTPUT, pull_control: Pull_up,
    drive_strength: low}
  - {pin_num: '20', peripheral: GPIOA, signal: 'GPIOA, 25', pin_signal: GPIOA25/ACMP0P/CS7/ETM_TRACEDAT1/CTIMER3_CAP1/RFE_TX_EN/FC3_SSEL0/SPIFI_IO1, identifier: LED_GREEN,
    direction: OUTPUT, pull_control: Pull_up, drive_strength: low}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/*FUNCTION**********************************************************************
 *
 * Function Name : BOARD_InitLEDs
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 *END**************************************************************************/
void BOARD_InitLEDs(void) {
  const uint32_t portA_pin13_config = (
    IOCON_FUNC0 |                                            /* Selects pin function 0 */
    IOCON_MODE_PULLUP |                                      /* Selects pull-up function */
    IOCON_DRIVE_LOW                                          /* Enable low drive strength */
  );
  IOCON_PinMuxSet(IOCON, PORTA_IDX, PIN13_IDX, portA_pin13_config); /* PORTA PIN13 (coords: 32) is configured as GPIOA13 */
  const uint32_t portA_pin25_config = (
    IOCON_FUNC0 |                                            /* Selects pin function 0 */
    IOCON_MODE_PULLUP |                                      /* Selects pull-up function */
    IOCON_DRIVE_LOW                                          /* Enable low drive strength */
  );
  IOCON_PinMuxSet(IOCON, PORTA_IDX, PIN25_IDX, portA_pin25_config); /* PORTA PIN25 (coords: 20) is configured as GPIOA25 */
  const uint32_t portA_pin31_config = (
    IOCON_FUNC0 |                                            /* Selects pin function 0 */
    IOCON_MODE_PULLUP |                                      /* Selects pull-up function */
    IOCON_DRIVE_LOW                                          /* Enable low drive strength */
  );
  IOCON_PinMuxSet(IOCON, PORTA_IDX, PIN31_IDX, portA_pin31_config); /* PORTA PIN31 (coords: 12) is configured as GPIOA31 */
}


