Wangzhongya123/NXPBLE_DEMO/bm/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSWD_DEBUG:
- options: {prefix: BOARD_, coreID: cm4}
- pin_list:
  - {pin_num: '23', peripheral: SWD, signal: SWCLK, pin_signal: SWCLK/GPIOA22/SCT0_IN2/CTIMER3_MAT0/FC2_SDA_SSEL0/FC3_SSEL3/QDEC1_A, pull_control: Pull_down, drive_strength: low}
  - {pin_num: '22', peripheral: SWD, signal: SWDIO, pin_signal: SWDIO/GPIOA23/SCT0_IN3/CTIMER3_MAT1/FC2_SCL_SSEL1/FC3_SSEL2/QDEC1_B, pull_control: High_Z, drive_strength: low}
  - {pin_num: '12', peripheral: SWD, signal: SWO, pin_signal: GPIOA31/DAC/RTC_CAP/CTIMER3_MAT2/SWO/FC3_SCK/SPIFI_CLK, identifier: SWO, pull_control: High_Z, drive_strength: low}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/*FUNCTION**********************************************************************
 *
 * Function Name : BOARD_InitSWD_DEBUG
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 *END**************************************************************************/
void BOARD_InitSWD_DEBUG(void) {
  const uint32_t portA_pin22_config = (
    IOCON_FUNC0 |                                            /* Selects pin function 0 */
    IOCON_MODE_PULLDOWN |                                    /* Selects pull-down function */
    IOCON_DRIVE_LOW                                          /* Enable low drive strength */
  );
  IOCON_PinMuxSet(IOCON, PORTA_IDX, PIN22_IDX, portA_pin22_config); /* PORTA PIN22 (coords: 23) is configured as SWCLK */
  const uint32_t portA_pin23_config = (
    IOCON_FUNC0 |                                            /* Selects pin function 0 */
    IOCON_MODE_HIGHZ |                                       /* Selects High-Z function */
    IOCON_DRIVE_LOW                                          /* Enable low drive strength */
  );
  IOCON_PinMuxSet(IOCON, PORTA_IDX, PIN23_IDX, portA_pin23_config); /* PORTA PIN23 (coords: 22) is configured as SWDIO */
  const uint32_t portA_pin31_config = (
    IOCON_FUNC4 |                                            /* Selects pin function 4 */
    IOCON_MODE_HIGHZ |                                       /* Selects High-Z function */
    IOCON_DRIVE_LOW                                          /* Enable low drive strength */
  );
  IOCON_PinMuxSet(IOCON, PORTA_IDX, PIN31_IDX, portA_pin31_config); /* PORTA PIN31 (coords: 12) is configured as SWO */
}


#define PIN24_IDX                       24u   /*!< Pin number for pin 24 in a port */
#define PIN25_IDX                       25u   /*!< Pin number for pin 25 in a port */
#define PIN28_IDX                       28u   /*!< Pin number for pin 28 in a port */
#define PIN29_IDX                       29u   /*!< Pin number for pin 29 in a port */
#define PIN30_IDX                       30u   /*!< Pin number for pin 30 in a port */
#define PORTA_IDX                        0u   /*!< Port index */

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitETM_TRACE:
- options: {prefix: BOARD_, coreID: cm4}
- pin_list:
  - {pin_num: '16', peripheral: ETM, signal: 'ETM_TRACEDATA, 2', pin_signal: GPIOA29/ACMP1N/ETM_TRACEDAT2/CTIMER3_MAT0/FC2_SCK/FC3_MISO/SPIFI_IO2, pull_control: High_Z,
    drive_strength: low}
  - {pin_num: '17', peripheral: ETM, signal: ETM_TRACECLK, pin_signal: GPIOA28/CLK_AHB/ETM_TRACECLK/RTC_CAP/FC1_SCK/SD_DAC/SPIFI_CSN, pull_control: High_Z, drive_strength: low}
  - {pin_num: '15', peripheral: ETM, signal: 'ETM_TRACEDATA, 3', pin_signal: GPIOA30/ACMP1P/ETM_TRACEDAT3/CTIMER3_MAT1/FC2_SCK/FC3_MOSI/SPIFI_IO3, identifier: ETM_TRACEDAT3,
    pull_control: High_Z, drive_strength: low}
  - {pin_num: '21', peripheral: ETM, signal: 'ETM_TRACEDATA, 0', pin_signal: GPIOA24/ACMP0N/CS6/ETM_TRACEDAT0/CTIMER3_CAP0/RFE_RX_EN/FC3_SSEL1/SPIFI_IO0, identifier: ETM_TRACEDAT0,
    pull_control: High_Z, drive_strength: low}
  - {pin_num: '20', peripheral: ETM, signal: 'ETM_TRACEDATA, 1', pin_signal: GPIOA25/ACMP0P/CS7/ETM_TRACEDAT1/CTIMER3_CAP1/RFE_TX_EN/FC3_SSEL0/SPIFI_IO1, identifier: ETM_TRACEDAT1,
    pull_control: High_Z, drive_strength: low}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/*FUNCTION**********************************************************************
 *
 * Function Name : BOARD_InitETM_TRACE
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 *END**************************************************************************/
void BOARD_InitETM_TRACE(void) {
  const uint32_t portA_pin24_config = (
    IOCON_FUNC2 |                                            /* Selects pin function 2 */
    IOCON_MODE_HIGHZ |                                       /* Selects High-Z function */
    IOCON_DRIVE_LOW                                          /* Enable low drive strength */
  );
  IOCON_PinMuxSet(IOCON, PORTA_IDX, PIN24_IDX, portA_pin24_config); /* PORTA PIN24 (coords: 21) is configured as ETM_TRACEDAT0 */
  const uint32_t portA_pin25_config = (
    IOCON_FUNC2 |                                            /* Selects pin function 2 */
    IOCON_MODE_HIGHZ |                                       /* Selects High-Z function */
    IOCON_DRIVE_LOW                                          /* Enable low drive strength */
  );
  IOCON_PinMuxSet(IOCON, PORTA_IDX, PIN25_IDX, portA_pin25_config); /* PORTA PIN25 (coords: 20) is configured as ETM_TRACEDAT1 */
  const uint32_t portA_pin28_config = (
    IOCON_FUNC2 |                                            /* Selects pin function 2 */
    IOCON_MODE_HIGHZ |                                       /* Selects High-Z function */
    IOCON_DRIVE_LOW                                          /* Enable low drive strength */
  );
  IOCON_PinMuxSet(IOCON, PORTA_IDX, PIN28_IDX, portA_pin28_config); /* PORTA PIN28 (coords: 17) is configured as ETM_TRACECLK */
  const uint32_t portA_pin29_config = (
    IOCON_FUNC2 |                                            /* Selects pin function 2 */
    IOCON_MODE_HIGHZ |                                       /* Selects High-Z function */
    IOCON_DRIVE_LOW                                          /* Enable low drive strength */
  );
  IOCON_PinMuxSet(IOCON, PORTA_IDX, PIN29_IDX, portA_pin29_config); /* PORTA PIN29 (coords: 16) is configured as ETM_TRACEDAT2 */
  const uint32_t portA_pin30_config = (
    IOCON_FUNC2 |                                            /* Selects pin function 2 */
    IOCON_MODE_HIGHZ |                                       /* Selects High-Z function */
    IOCON_DRIVE_LOW                                          /* Enable low drive strength */
  );
  IOCON_PinMuxSet(IOCON, PORTA_IDX, PIN30_IDX, portA_pin30_config); /* PORTA PIN30 (coords: 15) is configured as ETM_TRACEDAT3 */
}


